app/Http/Livewire/Comments/Comment.php

select * from `comments` where `commentable_id` = '40d23bcd-6dd9-4de7-b7d7-b5dd439755bd' and `commentable_type` = 'App\\Models\\Publication'
---
    public function getComments(){
        $this->comments = ModelsComment::where('commentable_id', $this->model->id)
            ->where('commentable_type', $this->modelClassName)
            ->with('user')
            ->with('responses')
            ->get();