app/Http/Livewire/Likes/Like.php

    public function toggleLike(){
        if ($this->liked) {
            $this->user->likes()->where('likeable_id', $this->likeable->id)->where('likeable_type', get_class($this->likeable))->delete();
---
select * from `likes` where `likes`.`likeable_type` = 'App\\Models\\Publication' and `likes`.`likeable_id` = 'b0f9d30c-6686-42d4-869f-b973381776a5' and `likes`.`likeable_id` is not null