app/Http/Livewire/Home.php

    public function mount(){

        $this->featuredPublications     = Publication::withCount('likes')->whereHas('likes')->orderByDesc('likes_count')->take(6)->get();
        $ids                            = $this->featuredPublications->pluck('id')->toArray();
        $this->recentPublications       = Publication::orderBy('created_at', 'desc')->whereNotIn('id', $ids)->take(6)->get();
---
select * from `publications` where `id` not in ('40d23bcd-6dd9-4de7-b7d7-b5dd439755bd', '68114384-c872-49f2-b616-2d5323ad90cf', '905130aa-db2d-477c-8347-d9a073679f57', '927b34f8-874d-4484-b277-6a40fe9e8a76', 'a24488d4-7000-4d4c-8897-59d9bb81baeb', 'e4666c68-2a39-47db-a4ac-bb74e503f7c4') order by `created_at` desc limit 6