app/Http/Livewire/Categories/Dropdown.php

    public function mount()
    {
        // Obtén las categorías en uso de las publicaciones
        $categoriesInUse = Publication::pluck('category')->toArray();
---
select `category` from `publications`