app/Http/Livewire/Publications/Publication.php

select * from `accounts` where `nickname` = 'creceagency' limit 1
select * from `publications` where `slug` = 'dop-nueva-identidad-corporativa' limit 1
---
    public function mount($account, $slug)
    {
        $this->account = Account::where('nickname', $account)->first();
        if ($this->account && $this->account->publications->contains('slug', $slug)) {
            $this->publication = ModelPublication::where('slug', $slug)->first();